using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class dt : MonoBehaviour
{
    // ÉXÉRÉAä÷òA
    public static int score;

    // ÉQÉbÉgÇµÇΩï∂éöî‘çÜ
    public static int getMoji;

    // ÉuÉçÉbÉNñº
    public static readonly string[] sLabel =
    {
        "00", "01", "02", "03",
        "10", "11", "12", "13", "14",
        "20", "21", "22", "23",
        "30", "31", "32", "33", "34",
        "40", "41", "42", "43",
        "50", "51", "52", "53", "54",
        "60", "61", "62", "63",
        "70", "71", "72", "73", "74",
        "80", "81", "82", "83",
        "90", "91", "92", "93", "94",
        "a0", "a1", "a2", "a3"
    };

    // ÉuÉçÉbÉNà íuç¿ïW
    public static readonly float[] x =
    {
        -3.6f, -1.2f, 1.2f, 3.6f,
        -4.2f, -2.4f, 0.0f, 2.4f, 4.2f,
        -3.6f, -1.2f, 1.2f, 3.6f,
        -4.2f, -2.4f, 0.0f, 2.4f, 4.2f,
        -3.6f, -1.2f, 1.2f, 3.6f,
        -4.2f, -2.4f, 0.0f, 2.4f, 4.2f,
        -3.6f, -1.2f, 1.2f, 3.6f,
        -4.2f, -2.4f, 0.0f, 2.4f, 4.2f,
        -3.6f, -1.2f, 1.2f, 3.6f,
        -4.2f, -2.4f, 0.0f, 2.4f, 4.2f,
        -3.6f, -1.2f, 1.2f, 3.6f
    };
    public static readonly float[] y =
    {
        8.00f, 8.00f, 8.00f, 8.00f,
        7.14f, 7.14f, 7.14f, 7.14f, 7.14f,
        6.28f, 6.28f, 6.28f, 6.28f,
        5.42f, 5.42f, 5.42f, 5.42f, 5.42f,
        4.56f, 4.56f, 4.56f, 4.56f,
        3.70f, 3.70f, 3.70f, 3.70f, 3.70f,
        2.84f, 2.84f, 2.84f, 2.84f,
        1.98f, 1.98f, 1.98f, 1.98f, 1.98f,
        1.12f, 1.12f, 1.12f, 1.12f,
        0.26f, 0.26f, 0.26f, 0.26f, 0.26f,
        -0.6f, -0.6f, -0.6f, -0.6f
    };

    // ç~Ç¡ÇƒÇ≠ÇÈï∂éö
    public static readonly string[,] moji =
    {
        { "êÊ", "ê∂", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°" },
        { "Çπ", "ÇÒ", "Çπ", "Ç¢", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°" },
        { "Çr", "Çd", "Çm", "Çr", "Çd", "Çh", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°" },
        { "êÊ", "ê∂", "åı", "éÂ", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°" },
        { "Çπ", "ÇÒ", "Çπ", "Ç¢", "Ç∫", "Ç¶", "ê¢", "à»", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°" },
        { "Çr", "Çd", "Çm", "Çr", "Çd", "Çh", "ÇT", "Çe", "áW", "ÇR", "ô∑", "ÇP", "Å°", "Å°" },
        { "êÊ", "ê∂", "åı", "éÂ", "ã§", "â§", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°" },
        { "Çπ", "ÇÒ", "Çπ", "Ç¢", "Ç∫", "Ç¶", "ê¢", "ÇË", "ô¿", "îV", "ñÁ", "Én", "Å°", "Å°" },
        { "Çr", "Çd", "Çm", "Çr", "Çd", "Çh", "ÇT", "Çe", "áW", "ÇR", "ô∑", "ÇP", "Çå", "Çk" }
    };
}
